-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 27, 2023 at 10:55 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `datalaundry`
--

-- --------------------------------------------------------

--
-- Table structure for table `list`
--

CREATE TABLE `list` (
  `list_id` int(4) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสสินค้า',
  `list_name` varchar(50) NOT NULL COMMENT 'ชื่อสินค้า',
  `detail` text NOT NULL COMMENT 'รายละเอียด',
  `type_id` int(3) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสประเภทสินค้า',
  `price` float(8,2) NOT NULL COMMENT 'ราคา',
  `image` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `list`
--

INSERT INTO `list` (`list_id`, `list_name`, `detail`, `type_id`, `price`, `image`) VALUES
(0001, 'เสื้อยืดแขนสั้น', 'ซักอบรีดเสื้อยืดแขนสั้น', 001, 30.00, '1.jpg'),
(0002, 'เสื้อยืดแขนยาว', 'ซักอบรีดเสื้อยืดแขนยาว', 001, 35.00, '2.jpg'),
(0003, 'เสื้อเชิ้ตแขนสั้น', 'ซักอบรีดเสื้อเชิ้ตแขนสั้น', 001, 30.00, '3.jpeg'),
(0004, 'เสื้อเชิ้ตแขนยาว', 'ซักอบรีดเสื้อเชิ้ตแขนยาว', 001, 35.00, '4.jpg'),
(0005, 'เสื้อโปโลแขนสั้น', 'ซักอบรีดเสื้อโปโลแขนสั้น', 001, 30.00, '5.jpg'),
(0006, 'เสื้อโปโลแขนยาว', 'ซักอบรีดเสื้อโปโลแขนยาว', 001, 35.00, '6.jpg'),
(0007, 'เสื้อลำลอง', 'ซักอบรีดเสื้อลำลอง', 001, 30.00, '7.jpg'),
(0008, 'เสื้อแจ็คเก็ต', 'ซักอบรีดเสื้อแจ็คเก็ต', 001, 50.00, '8.jpg'),
(0009, 'ชุดเดรส', 'ซักอบรีดชุดเดรส', 001, 50.00, '9.jpg'),
(0010, 'กางเกงขาสั้น', 'ซักอบรีดกางเกงขาสั้น', 001, 30.00, '10.jpg'),
(0011, 'กางเกงขายาว', 'ซักอบรีดกางเกงขายาว', 001, 35.00, '11.jpg'),
(0012, 'กระโปรง', 'ซักอบรีดกระโปรง', 001, 30.00, '12.jpg'),
(0013, 'กระโปรงจีบรอบ', 'ซักอบรีดกระโปรงจีบรอบ', 001, 50.00, '13.jpg'),
(0014, 'ยีนส์', 'ซักอบรีดยีนส์', 001, 50.00, '14.jpg'),
(0015, 'หมวก', 'ซักอบรีดหมวก', 001, 30.00, '15.jpg'),
(0016, 'ผ้าพันคอ', 'ซักอบรีดผ้าพันคอ', 001, 30.00, '16.jpg'),
(0017, 'ผ้าเช็ดตัว', 'ซักอบรีดผ้าเช็ดตัว', 001, 30.00, '17.jpg'),
(0018, 'ปลอกหมอน', 'ซักอบรีดปลอกหมอน', 001, 25.00, '18.jpg'),
(0019, 'ผ้าปูที่นอน', 'ซักอบรีดผ้าปูที่นอน', 001, 50.00, '19.jpg'),
(0020, 'ปลอกผ้านวม', 'ซักอบรีดปลอกผ้านวม', 001, 100.00, '20.jpg'),
(0021, 'ผ้านวมขนาด3.5 - 4.9 ฟุต', 'ซักอบรีดผ้านวมขนาด3.5 - 4.9ฟุต', 001, 150.00, '21.jpg'),
(0022, 'ผ้านวมขนาด5ฟุตขึ้นไป', 'ซักอบรีดผ้านวมขนาด5ฟุตขึ้นไป', 001, 200.00, '22.jpg'),
(0023, 'ผ้าห่ม', 'ซักอบรีดผ้าห่ม', 001, 150.00, '23.jpg'),
(0024, 'ซาฟารี', 'ซักแห้งซาฟารี', 002, 250.00, '24.jpg'),
(0025, 'สูท', 'ซักแห้งสูท', 002, 250.00, '25.jpg'),
(0026, 'ผ้าไหม', 'ซักแห้งผ้าไหม', 002, 150.00, '26.jpg'),
(0027, 'เสื้อกันหนาว', 'ซักแห้งเสื้อกันหนาว', 002, 150.00, '27.jpg'),
(0028, 'เสื้อโคทสั้น', 'ซักแห้งเสื้อโคทสั้น', 002, 250.00, '28.jpg'),
(0029, 'เสื้อโคทยาว', 'ซักแห้งเสื้อโคทยาว', 002, 300.00, '29.jpg'),
(0030, 'ชุดราตรี', 'ซักแห้งชุดราตรี', 002, 300.00, '30.jpg'),
(0031, 'ชุดครุย', 'ซักแห้งชุดครุย', 002, 300.00, '31.jpg'),
(0032, 'เนคไท', 'ซักแห้งเนคไท', 002, 70.00, '32.jpg'),
(0033, 'เสื้อยืดแขนสั้น', 'ซักแห้งเสื้อยืดแขนสั้น', 002, 75.00, '1.jpg'),
(0034, 'เสื้อยืดแขนยาว', 'ซักแห้งเสื้อยืดแขนยาว', 002, 90.00, '2.jpg'),
(0035, 'เสื้อเชิ้ตแขนสั้น', 'ซักแห้งเสื้อเชิ้ตแขนสั้น', 002, 75.00, '3.jpg'),
(0036, 'เสื้อเชิ้ตแขนยาว', 'ซักแห้งเสื้อเชิ้ตแขนยาว', 002, 90.00, '4.jpg'),
(0037, 'เสื้อโปโลแขนสั้น', 'ซักแห้งเสื้อโปโลแขนสั้น', 002, 75.00, '5.jpg'),
(0038, 'เสื้อโปโลแขนยาว', 'ซักแห้งเสื้อโปโลแขนยาว', 002, 90.00, '6.jpg'),
(0039, 'เสื้อลำลอง', 'ซักแห้งเสื้อลำลอง', 002, 75.00, '7.jpg'),
(0040, 'เสื้อแจ็คเก็ต', 'ซักแห้งเสื้อแจ็คเก็ต', 002, 150.00, '8.jpg'),
(0041, 'ชุดเดรส', 'ซักแห้งชุดเดรส', 002, 150.00, '9.jpg'),
(0042, 'กางเกงขาสั้น', 'ซักแห้งกางเกงขาสั้น', 002, 75.00, '10.jpg'),
(0043, 'กางเกงขายาว', 'ซักแห้งกางเกงขายาว', 002, 90.00, '11.jpg'),
(0044, 'กระโปรง', 'ซักแห้งกระโปรง', 002, 90.00, '12.jpg'),
(0045, 'กระโปรงจีบรอบ', 'ซักแห้งกระโปรงจีบรอบ', 002, 150.00, '13.jpg'),
(0046, 'ยีนส์', 'ซักแห้งยีนส์', 002, 150.00, '14.jpg'),
(0047, 'หมวก', 'ซักแห้งหมวก', 002, 90.00, '15.jpg'),
(0048, 'ผ้าพันคอ', 'ซักแห้งผ้าพันคอ', 002, 90.00, '16.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `list`
--
ALTER TABLE `list`
  ADD PRIMARY KEY (`list_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `list`
--
ALTER TABLE `list`
  MODIFY `list_id` int(4) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT 'รหัสสินค้า', AUTO_INCREMENT=49;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
